In [1]:
import pandas as pd
import numpy as np

# Initial data
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"],
    "Age": [25, 30, 35, 40, 22, 28, 45],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio"],
    "Salary": [70000, 80000, 120000, 90000, 60000, 75000, 110000]
}

df = pd.DataFrame(data)

In [2]:
# ans 1: Shape and dtypes
print("Shape:", df.shape)
print("\nData Types:")
print(df.dtypes)

Shape: (7, 4)

Data Types:
Name      object
Age        int64
City      object
Salary     int64
dtype: object

In [3]:
# ans 2: Custom index
ids = ['ID1', 'ID2', 'ID3', 'ID4', 'ID5', 'ID6', 'ID7']
df_custom = pd.DataFrame(data, index=ids)
df_custom

        Name  Age          City  Salary
ID1    Alice   25      New York   70000
ID2      Bob   30   Los Angeles   80000
ID3  Charlie   35       Chicago  120000
ID4    David   40       Houston   90000
ID5      Eva   22       Phoenix   60000
ID6    Frank   28  Philadelphia   75000
ID7    Grace   45   San Antonio  110000

In [4]:
# ans 2: Custom index
ids = ['ID1', 'ID2', 'ID3', 'ID4', 'ID5', 'ID6', 'ID7']
df_custom = pd.DataFrame(data, index=ids)
df_custom

        Name  Age          City  Salary
ID1    Alice   25      New York   70000
ID2      Bob   30   Los Angeles   80000
ID3  Charlie   35       Chicago  120000
ID4    David   40       Houston   90000
ID5      Eva   22       Phoenix   60000
ID6    Frank   28  Philadelphia   75000
ID7    Grace   45   San Antonio  110000

In [5]:
# ans 3: Select Name and Salary
df_subset = df[["Name", "Salary"]]
df_subset

      Name  Salary
0    Alice   70000
1      Bob   80000
2  Charlie  120000
3    David   90000
4      Eva   60000
5    Frank   75000
6    Grace  110000

In [6]:
# ans 4: Rows 2,3,4 using iloc
df.iloc[2:5]

      Name  Age     City  Salary
2  Charlie   35  Chicago  120000
3    David   40  Houston   90000
4      Eva   22  Phoenix   60000

In [7]:
# ans 5: Name and Age for index labels 1, 3, 5
df.loc[[1, 3, 5], ["Name", "Age"]]

    Name  Age
1    Bob   30
3  David   40
5  Frank   28

In [8]:
# ans 6: City of 4th row (index 3)
df.iloc[3, df.columns.get_loc("City")]

'Houston'

In [9]:
# ans 7: First 3 and last 2 rows
print(df.head(3))
print("\n")
print(df.tail(2))

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000


    Name  Age          City  Salary
5  Frank   28  Philadelphia   75000
6  Grace   45   San Antonio  110000

In [10]:
# ans 8: Describe including object columns
df.describe(include="all")

         Name        Age      City         Salary
count       7   7.000000         7       7.000000
unique      7        NaN         7            NaN
top     Alice        NaN  New York            NaN
freq        1        NaN         1            NaN
mean      NaN  32.142857       NaN   86428.571429
std       NaN   8.275034       NaN   21739.803302
min       NaN  22.000000       NaN   60000.000000
25%       NaN  26.500000       NaN   72500.000000
50%       NaN  30.000000       NaN   80000.000000
75%       NaN  37.500000       NaN  100000.000000
max       NaN  45.000000       NaN  120000.000000

In [11]:
# ans 9: Rename Salary â†’ Annual Income
df.rename(columns={"Salary": "Annual Income"}, inplace=True)
df

      Name  Age          City  Annual Income
0    Alice   25      New York          70000
1      Bob   30   Los Angeles          80000
2  Charlie   35       Chicago         120000
3    David   40       Houston          90000
4      Eva   22       Phoenix          60000
5    Frank   28  Philadelphia          75000
6    Grace   45   San Antonio         110000

In [12]:
# ans 10: Rename Name and City
df.rename(columns={"Name": "Full Name", "City": "Location"}, inplace=True)
df

  Full Name  Age      Location  Annual Income
0     Alice   25      New York          70000
1       Bob   30   Los Angeles          80000
2   Charlie   35       Chicago         120000
3     David   40       Houston          90000
4       Eva   22       Phoenix          60000
5     Frank   28  Philadelphia          75000
6     Grace   45   San Antonio         110000

In [13]:
# ans 11: Drop Location column
df.drop(columns=["Location"], inplace=True)
df

  Full Name  Age  Annual Income
0     Alice   25          70000
1       Bob   30          80000
2   Charlie   35         120000
3     David   40          90000
4       Eva   22          60000
5     Frank   28          75000
6     Grace   45         110000

In [14]:
# ans 12: Drop row at index 3
df.drop(index=3, inplace=True)
df

  Full Name  Age  Annual Income
0     Alice   25          70000
1       Bob   30          80000
2   Charlie   35         120000
4       Eva   22          60000
5     Frank   28          75000
6     Grace   45         110000

In [15]:
# ans 13: Add Country column
df["Country"] = "USA"
df

  Full Name  Age  Annual Income Country
0     Alice   25          70000     USA
1       Bob   30          80000     USA
2   Charlie   35         120000     USA
4       Eva   22          60000     USA
5     Frank   28          75000     USA
6     Grace   45         110000     USA

In [16]:
# ans 14: Birth Year column (assuming 2025)
df["Birth Year"] = 2025 - df["Age"]
df

  Full Name  Age  Annual Income Country  Birth Year
0     Alice   25          70000     USA        2000
1       Bob   30          80000     USA        1995
2   Charlie   35         120000     USA        1990
4       Eva   22          60000     USA        2003
5     Frank   28          75000     USA        1997
6     Grace   45         110000     USA        1980

In [17]:
# ans 15: Department column
df["Department"] = ['HR', 'Eng', 'Eng', 'HR', 'Sales', 'Admin']
df

  Full Name  Age  Annual Income Country  Birth Year Department
0     Alice   25          70000     USA        2000         HR
1       Bob   30          80000     USA        1995        Eng
2   Charlie   35         120000     USA        1990        Eng
4       Eva   22          60000     USA        2003         HR
5     Frank   28          75000     USA        1997      Sales
6     Grace   45         110000     USA        1980      Admin

In [18]:
# ans 16: Convert DataFrame to NumPy array
np_array = df.to_numpy()
np_array

array([['Alice', 25, 70000, 'USA', 2000, 'HR'],
       ['Bob', 30, 80000, 'USA', 1995, 'Eng'],
       ['Charlie', 35, 120000, 'USA', 1990, 'Eng'],
       ['Eva', 22, 60000, 'USA', 2003, 'HR'],
       ['Frank', 28, 75000, 'USA', 1997, 'Sales'],
       ['Grace', 45, 110000, 'USA', 1980, 'Admin']], dtype=object)

In [19]:
# ans 17: Empty DataFrame and add columns
df_empty = pd.DataFrame()
df_empty["A"] = [1, 2, 3]
df_empty["B"] = [4, 5, 6]
df_empty

   A  B
0  1  4
1  2  5
2  3  6

In [20]:
# ans 18: Age before Full Name
cols = df.columns.tolist()
cols.insert(0, cols.pop(cols.index("Age")))
df = df[cols]
df

   Age Full Name  Annual Income Country  Birth Year Department
0   25     Alice          70000     USA        2000         HR
1   30       Bob          80000     USA        1995        Eng
2   35   Charlie         120000     USA        1990        Eng
4   22       Eva          60000     USA        2003         HR
5   28     Frank          75000     USA        1997      Sales
6   45     Grace         110000     USA        1980      Admin

In [21]:
# ans 19: Update Alice's age to 26
df.loc[df["Full Name"] == "Alice", "Age"] = 26
df

   Age Full Name  Annual Income Country  Birth Year Department
0   26     Alice          70000     USA        2000         HR
1   30       Bob          80000     USA        1995        Eng
2   35   Charlie         120000     USA        1990        Eng
4   22       Eva          60000     USA        2003         HR
5   28     Frank          75000     USA        1997      Sales
6   45     Grace         110000     USA        1980      Admin

In [22]:
# ans 20: Random sample of 3 rows
df.sample(n=3, random_state=42)

   Age Full Name  Annual Income Country  Birth Year Department
0   26     Alice          70000     USA        2000         HR
1   30       Bob          80000     USA        1995        Eng
6   45     Grace         110000     USA        1980      Admin